import random as r

def a():
    num1 = r.randint(0, 100)
    while True:
        hads = int(input("بین 0 تا 100 یک عدد بگویید "))
        if (hads == num1):
            print("/////////////////////////////////")
            print("درست حدس زدی")
            print(num1)
            break
        elif (hads in range(num1 - 10, num1 + 3)):# با کم کردن این دامنه میتوان بازی را سخت تر کرد
            #چون عددی حدسی ما با رنج  10 تا کمتر از هدف و 3 تا بیشتر از حدف برسی میشود هرچی رنج بزرگتر پیدا کردن عدد سخ تر میشود
            print("/////////////////////////////////")
            print("نزدیک شدی")
            
        else:
            
            print("داری دور میشی")
            print("/////////////////////////////////")
a()